import unittest
from create_index import format_csv_obj

class TestCreateIndex(unittest.TestCase):

    def test_format_csv_obj_single(self):
        li = [
            ['', '', '1000001', '', '', '', '北海道', 'テスト', '１条', '0', '0', '0', '0', '0', '0'],
        ]
        expected = {
            1: '北海道テスト１条',
        }
        actual = format_csv_obj(li)
        self.assertEqual(expected, actual)

    def test_format_csv_obj_multi(self):
        li = [
            ['', '', '1000001', '', '', '', '北海道', 'テスト', '１条', '0', '0', '0', '0', '0', '0'],
            ['', '', '1000002', '', '', '', '北海道', 'テスト', '２条', '0', '0', '0', '0', '0', '0'],
            ['', '', '1000003', '', '', '', '北海道', 'テスト重複', '３条１', '0', '0', '0', '0', '0', '0'],
            ['', '', '1000003', '', '', '', '北海道', 'テスト重複', 'ー２', '0', '0', '0', '0', '0', '0'],
            ['', '', '1000003', '', '', '', '北海道', 'テスト重複', 'ー３', '0', '0', '0', '0', '0', '0'],
            ['', '', '1000004', '', '', '', '北海道', 'テスト複数〒１', '複数１', '0', '0', '0', '1', '0', '0'],
            ['', '', '1000004', '', '', '', '北海道', 'テスト複数〒２', '複数２', '0', '0', '0', '1', '0', '0'],
            ['', '', '1000004', '', '', '', '北海道', 'テスト複数〒３', '複数３', '0', '0', '0', '1', '0', '0'],
            ['', '', '1000005', '', '', '', '北海道', 'テスト', '５条', '0', '0', '0', '0', '0', '0'],
            ['', '', '1000006', '', '', '', '北海道', 'テスト', '６条', '0', '0', '0', '0', '0', '0'],
        ]
        expected = {
            1: '北海道テスト１条',
            2: '北海道テスト２条',
            3: '北海道テスト重複３条１ー２ー３',
            6: '北海道テスト複数〒１複数１',
            7: '北海道テスト複数〒２複数２',
            8: '北海道テスト複数〒３複数３',
            9: '北海道テスト５条',
            10: '北海道テスト６条'
        }
        actual = format_csv_obj(li)
        self.assertEqual(expected, actual)
